Revit 2021.1 API
ImageTypeOptions Constructor
Overload List
Name | Description
ImageTypeOptions() |  Obsolete.
 Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String) |  Obsolete.
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
ImageTypeOptions(String, Boolean) |  Obsolete.
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the path used by ImageType should be absolute or relative.
ImageTypeOptions(ExternalResourceReference, ImageTypeSource)
 Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String, Boolean, ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the imagetype will be a link or an import.
See Also
ImageTypeOptions Class
ImageTypeOptions Members
Autodesk.Revit.DB Namespace